Documents/ЛБ_РасходОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОтходыДМВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБезТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОтходыДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_РасходОтходовДМ/Ext/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходнаяНакладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РасходнаяНакладная",  "Накладная на внутреннее перемещение", 
		ПечатьРасходнойНакладной(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_РасходОтходовДМ.НакладнаяПеремещенияОтходов");
	КонецЕсли;

КонецПроцедуры  

Функция ПечатьРасходнойНакладной(МассивОбъектов, ОбъектыПечати)
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб			= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
    ТабДокумент.ТолькоПросмотр = Истина;
	
	Док = МассивОбъектов[0];

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЛБ_РасходОтходовДМ.НакладнаяПеремещенияОтходов");

	НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

	ОбластьМакета = Макет.ПолучитьОбласть("Документ");
	ОбластьМакета.Параметры.Номер = Док.НомерДокумента;
	ОбластьМакета.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.Вес = Формат(Док.ВесБезТары, "ЧДЦ=2");
	ОбластьМакета.Параметры.Сотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Док.Инкассатор.ФизическоеЛицо.Наименование); //Док.Инкассатор;
	ОбластьМакета.Параметры.Должность = Док.Инкассатор.Должность;
	ОбластьМакета.Параметры.Отправитель = Док.Ломбард;
	ОбластьМакета.Параметры.Получатель = Док.Получатель;
	ОбластьМакета.Параметры.ОтпустилДолжность = Док.Ответственный.Должность;
	ОбластьМакета.Параметры.ОтпустилСотрудник = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Док.Ответственный.ФизическоеЛицо.Наименование);
	ТабДокумент.Вывести(ОбластьМакета);

	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Док);
			
	Возврат ТабДокумент;

КонецФункции
